Revit 2027 API
PDFExportOptions.GetNamingRule Method
 Gets a copy of the naming rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<TableCellCombinedParameterData> GetNamingRule()
Public Function GetNamingRule As IList(Of TableCellCombinedParameterData)
public:
IList<TableCellCombinedParameterData^>^ GetNamingRule()
member GetNamingRule : unit -> IList<TableCellCombinedParameterData>
Return Value
IList<TableCellCombinedParameterData>
 The naming rule.
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace